{
  "@odata.type": "#microsoft.graph.azureADWindowsAutopilotDeploymentProfile",
  "displayName": "IA - Windows - Autopilot - D - Cloud PC v1.0.0",
  "description": "Windows Autopilot deployment profile for Cloud PCs",
  "language": "os-default",
  "locale": "os-default",
  "extractHardwareHash": false,
  "hardwareHashExtractionEnabled": false,
  "deviceNameTemplate": "%SERIAL%",
  "deviceType": "windowsPc",
  "enableWhiteGlove": true,
  "preprovisioningAllowed": true,
  "managementServiceAppId": null
  }