{
  "@odata.type": "#microsoft.graph.azureADWindowsAutopilotDeploymentProfile",
  "id": "18de7046-4762-45cd-9ad5-42804f7cb6a3",
  "displayName": "IA - Windows - Autopilot - D - Cloud PC v1.0.0",
  "description": "",
  "language": "os-default",
  "locale": "os-default",
  "createdDateTime": "2025-02-17T16:55:24.525665Z",
  "lastModifiedDateTime": "2025-02-21T13:24:55.7258422Z",
  "enrollmentStatusScreenSettings": null,
  "extractHardwareHash": false,
  "hardwareHashExtractionEnabled": false,
  "deviceNameTemplate": "%SERIAL%",
  "deviceType": "windowsPc",
  "enableWhiteGlove": true,
  "preprovisioningAllowed": true,
  "managementServiceAppId": null,
  "outOfBoxExperienceSettings": {
    "@odata.type": "microsoft.graph.outOfBoxExperienceSettings",
    "hidePrivacySettings": true,
    "hideEULA": true,
    "userType": "standard",
    "deviceUsageType": "singleUser",
    "skipKeyboardSelectionPage": false,
    "hideEscapeLink": true
  },
  "outOfBoxExperienceSetting": {
    "@odata.type": "microsoft.graph.outOfBoxExperienceSetting",
    "privacySettingsHidden": true,
    "eulaHidden": true,
    "userType": "standard",
    "deviceUsageType": "singleUser",
    "keyboardSelectionPageSkipped": false,
    "escapeLinkHidden": true
  }
}
