{
  "@odata.type": "#microsoft.graph.azureADWindowsAutopilotDeploymentProfile",
  "displayName": "IA - Windows - Autopilot - D - Cloud PC v1.0.0",
  "description": "Windows Autopilot deployment profile for Cloud PCs",
  "language": "os-default",
  "locale": "os-default",
  "createdDateTime": "2025-02-17T16:55:24.525665Z",
  "lastModifiedDateTime": "2025-02-17T16:55:24.525665Z",
   "extractHardwareHash": false,
  "hardwareHashExtractionEnabled": false,
  "deviceNameTemplate": "%SERIAL%",
  "deviceType": "windowsPc",
  "enableWhiteGlove": true,
  "preprovisioningAllowed": true,
  "managementServiceAppId": null,
  "outOfBoxExperienceSettings": {
    "@odata.type": "microsoft.graph.outOfBoxExperienceSetting",
    "hidePrivacySettings": true,
    "hideEULA": true,
    "userType": "standard",
    "deviceUsageType": "singleUser",
    "skipKeyboardSelectionPage": false,
    "hideEscapeLink": true
  },
  "enrollmentStatusScreenSettings": {
    "@odata.type": "microsoft.graph.windowsEnrollmentStatusScreenSettings",
    "hideInstallationProgress": true,
    "allowDeviceUseBeforeProfileAndAppInstallComplete": true,
    "blockDeviceSetupRetryByUser": true,
    "allowLogCollectionOnInstallFailure": true,
    "customErrorMessage": "Timeout of 60 minutes occurred, please contact support",
    "installProgressTimeoutInMinutes": 60,
    "allowDeviceUseOnInstallFailure": true
  }
}
