{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-02-14T13:29:24.8603602Z","creationSource":null,"description":"","lastModifiedDateTime":"2025-02-14T13:29:24.8603602Z","name":"Win - OIB - Defender Antivirus Updates - Ring 3 - Production","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":3,"technologies":"mdm,microsoftSense","id":"c47fa8a2-ce7a-43bf-8ccb-107e1c22e91c","templateReference":{"templateId":"e3f74c5a-a6de-411d-aef6-eb15628f3a0a_1","templateFamily":"endpointSecurityAntivirus","templateDisplayName":"Defender Update controls","templateDisplayVersion":"Version 1"},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_defender_configuration_engineupdateschannel","settingInstanceTemplateReference":{"settingInstanceTemplateId":"f7e1409d-9c85-4a3f-85a6-ad05cc8ccf13"},"choiceSettingValue":{"value":"device_vendor_msft_defender_configuration_engineupdateschannel_5","settingValueTemplateReference":{"settingValueTemplateId":"afc8df70-7b19-4335-b200-bf4b7e098f67","useTemplateDefault":false},"children":[]}}},{"id":"1","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_defender_configuration_platformupdateschannel","settingInstanceTemplateReference":{"settingInstanceTemplateId":"e78b3ace-75d0-4aad-b3fa-4f49390d6483"},"choiceSettingValue":{"value":"device_vendor_msft_defender_configuration_platformupdateschannel_5","settingValueTemplateReference":{"settingValueTemplateId":"d3b0d61a-bdc5-4507-84d0-5f2a4a3e11a5","useTemplateDefault":false},"children":[]}}},{"id":"2","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_defender_configuration_securityintelligenceupdateschannel","settingInstanceTemplateReference":{"settingInstanceTemplateId":"ba273649-e186-4377-89d5-87405bc9a87c"},"choiceSettingValue":{"value":"device_vendor_msft_defender_configuration_securityintelligenceupdateschannel_5","settingValueTemplateReference":{"settingValueTemplateId":"41ea06bf-e94a-482a-9aaa-7fd535fb4150","useTemplateDefault":false},"children":[]}}}]}