{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-02-14T13:29:38.7358886Z","creationSource":null,"description":"","lastModifiedDateTime":"2025-02-14T13:29:38.7358886Z","name":"Win - OIB - Google Chrome - U - Profiles, Sign-In and Sync - v3.0","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":8,"technologies":"mdm","id":"75237815-2f76-4ee1-83a8-d48800c5a58b","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_browsersignin","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_browsersignin_1","children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_browsersignin_browsersignin","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_browsersignin_browsersignin_0","children":[]}}]}}},{"id":"1","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_syncdisabled","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_syncdisabled_1","children":[]}}},{"id":"2","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_browseraddpersonenabled","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_browseraddpersonenabled_0","children":[]}}},{"id":"3","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_browserguestmodeenabled","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_browserguestmodeenabled_0","children":[]}}},{"id":"4","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_roamingprofilesupportenabled","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_roamingprofilesupportenabled_0","children":[]}}},{"id":"5","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_forceephemeralprofiles","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_forceephemeralprofiles_0","children":[]}}},{"id":"6","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_profilepickeronstartupavailability","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_profilepickeronstartupavailability_0","children":[]}}},{"id":"7","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_restrictsignintopattern","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_restrictsignintopattern_0","children":[]}}}]}