{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-02-14T13:29:36.4082553Z","creationSource":null,"description":"","lastModifiedDateTime":"2025-02-14T13:29:36.4082553Z","name":"Win - OIB - Encryption - D - BitLocker (OS Disk) - v3.0","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":8,"technologies":"mdm","id":"1fa1f7c3-a652-43e8-9e8a-bc9db623f794","templateReference":{"templateId":"46ddfc50-d10f-4867-b852-9434254b3bff_1","templateFamily":"endpointSecurityDiskEncryption","templateDisplayName":"BitLocker","templateDisplayVersion":"Version 1"},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesencryptiontype","settingInstanceTemplateReference":{"settingInstanceTemplateId":"d3e31794-1ce6-4572-ab0c-0c0f9200a509"},"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_systemdrivesencryptiontype_1","settingValueTemplateReference":{"settingValueTemplateId":"54f346c7-008f-421c-bcb5-40f822bb97fe","useTemplateDefault":false},"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesencryptiontype_osencryptiontypedropdown_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_bitlocker_systemdrivesencryptiontype_osencryptiontypedropdown_name_1","children":[]}}]}}},{"id":"1","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication","settingInstanceTemplateReference":{"settingInstanceTemplateId":"a5673a18-196d-49a0-a460-a8f35b807b45"},"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_1","settingValueTemplateReference":{"settingValueTemplateId":"f742e25d-2f09-41f7-9556-6af75960f42b","useTemplateDefault":false},"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmpinkeyusagedropdown_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmpinkeyusagedropdown_name_0","children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configurepinusagedropdown_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configurepinusagedropdown_name_0","children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmusagedropdown_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmusagedropdown_name_1","children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configurenontpmstartupkeyusage_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configurenontpmstartupkeyusage_name_0","children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmstartupkeyusagedropdown_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmstartupkeyusagedropdown_name_0","children":[]}}]}}},{"id":"2","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesdisallowstandarduserscanchangepin","settingInstanceTemplateReference":{"settingInstanceTemplateId":"ff95fd7f-52a0-4030-8452-6143352ab487"},"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_systemdrivesdisallowstandarduserscanchangepin_1","settingValueTemplateReference":{"settingValueTemplateId":"3b874ce3-3254-4db9-ab65-1b591f543ed3","useTemplateDefault":false},"children":[]}}},{"id":"3","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions","settingInstanceTemplateReference":{"settingInstanceTemplateId":"5a350519-4bc6-4443-9c4b-6859a054ff83"},"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_1","settingValueTemplateReference":{"settingValueTemplateId":"2a756c45-f135-442f-9c01-829a9c9b5407","useTemplateDefault":false},"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_oshiderecoverypage_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_oshiderecoverypage_name_1","children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osallowdra_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osallowdra_name_0","children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverykeyusagedropdown_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverykeyusagedropdown_name_2","children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackupdropdown_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackupdropdown_name_1","children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrequireactivedirectorybackup_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrequireactivedirectorybackup_name_1","children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackup_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackup_name_1","children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverypasswordusagedropdown_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverypasswordusagedropdown_name_1","children":[]}}]}}},{"id":"4","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_encryptionmethodbydrivetype","settingInstanceTemplateReference":{"settingInstanceTemplateId":"d1625438-8db8-424f-b605-cf001b7a2f97"},"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_1","settingValueTemplateReference":{"settingValueTemplateId":"7cd99564-6bd0-42c8-be6a-5d92c6c1faaf","useTemplateDefault":false},"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsrdvdropdown_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsrdvdropdown_name_4","children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsfdvdropdown_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsfdvdropdown_name_7","children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsosdropdown_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsosdropdown_name_7","children":[]}}]}}},{"id":"5","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_requiredeviceencryption","settingInstanceTemplateReference":{"settingInstanceTemplateId":"20ec1f6e-0d7a-4b6f-9a4f-9ed33e69ce51"},"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_requiredeviceencryption_1","settingValueTemplateReference":{"settingValueTemplateId":"86da5fa5-67cf-48d1-8215-8787a9900ae6","useTemplateDefault":false},"children":[]}}},{"id":"6","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_allowwarningforotherdiskencryption","settingInstanceTemplateReference":{"settingInstanceTemplateId":"e40531ee-2225-406b-b07b-1c17186c088c"},"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_allowwarningforotherdiskencryption_0","settingValueTemplateReference":{"settingValueTemplateId":"7d348597-0f2a-43db-9fad-8b55c4f89bfe","useTemplateDefault":false},"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_allowstandarduserencryption","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_bitlocker_allowstandarduserencryption_1","children":[]}}]}}},{"id":"7","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_configurerecoverypasswordrotation","settingInstanceTemplateReference":{"settingInstanceTemplateId":"48c938a7-afa0-40ef-914f-40b5da5735b4"},"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_configurerecoverypasswordrotation_1","settingValueTemplateReference":{"settingValueTemplateId":"48278072-3b30-48e9-b654-ad683fdb9aae","useTemplateDefault":false},"children":[]}}}]}